Practica Docker-Compose/consul-service-discovery/consul-haproxy-cluster/artillery/stress-test.yml
config:
  target: http://192.168.50.10
  phases:
    - duration: 30
      arrivalRate: 1
      name: "Baseline"
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained high load"
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    - duration: 30
      arrivalRate: 100
      rampTo: 1
      name: "Ramp down"
  processor: "./functions.js"

scenarios:
  - name: "High load basic requests"
    weight: 60
    flow:
      - get:
          url: "/"
          capture:
            json: "$.node.name"
            as: "serving_node"
      - function: "trackNodeResponses"
      
  - name: "CPU intensive work"
    weight: 30
    flow:
      - function: "setRandomDuration"
      - get:
          url: "/work?duration={{ duration }}"
          expect:
            - statusCode: 200
            
  - name: "Health monitoring"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200